Res-container-setEven-randomFront-v6/container_t_10_c_30_frontCore_4_wrkCore_1/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 4891.740ms, rate sampling interval: 17743ms
  Thread calibration: mean lat.: 4890.547ms, rate sampling interval: 17743ms
  Thread calibration: mean lat.: 4867.791ms, rate sampling interval: 17924ms
  Thread calibration: mean lat.: 4867.264ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4929.512ms, rate sampling interval: 17858ms
  Thread calibration: mean lat.: 4919.846ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 4885.602ms, rate sampling interval: 17711ms
  Thread calibration: mean lat.: 4955.355ms, rate sampling interval: 17874ms
  Thread calibration: mean lat.: 4867.502ms, rate sampling interval: 17842ms
  Thread calibration: mean lat.: 4901.328ms, rate sampling interval: 17760ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    34.35s    13.60s    0.96m    58.08%
    Req/Sec   163.65      4.14   170.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   34.70s 
 75.000%   46.10s 
 90.000%    0.87m 
 99.000%    0.96m 
 99.900%    0.99m 
 99.990%    0.99m 
 99.999%    0.99m 
100.000%    0.99m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9871.359     0.000000            6         1.00
   15138.815     0.100000         8271         1.11
   20250.623     0.200000        16541         1.25
   25247.743     0.300000        24800         1.43
   30130.175     0.400000        33081         1.67
   34701.311     0.500000        41332         2.00
   37093.375     0.550000        45465         2.22
   39485.439     0.600000        49598         2.50
   41713.663     0.650000        53788         2.86
   43876.351     0.700000        57877         3.33
   46104.575     0.750000        61994         4.00
   47284.223     0.775000        64073         4.44
   48398.335     0.800000        66123         5.00
   49577.983     0.825000        68216         5.71
   50561.023     0.850000        70277         6.67
   51478.527     0.875000        72314         8.00
   51970.047     0.887500        73351         8.89
   52494.335     0.900000        74443        10.00
   53018.623     0.912500        75477        11.43
   53608.447     0.925000        76460        13.33
   54198.271     0.937500        77496        16.00
   54525.951     0.943750        78060        17.78
   54820.863     0.950000        78568        20.00
   55115.775     0.956250        79049        22.86
   55476.223     0.962500        79562        26.67
   55836.671     0.968750        80092        32.00
   56000.511     0.971875        80319        35.56
   56229.887     0.975000        80584        40.00
   56492.031     0.978125        80848        45.71
   56754.175     0.981250        81100        53.33
   57114.623     0.984375        81399        64.00
   57245.695     0.985938        81498        71.11
   57409.535     0.987500        81638        80.00
   57606.143     0.989062        81760        91.43
   57802.751     0.990625        81891       106.67
   57999.359     0.992188        82008       128.00
   58097.663     0.992969        82062       142.22
   58228.735     0.993750        82129       160.00
   58392.575     0.994531        82195       182.86
   58556.415     0.995313        82258       213.33
   58687.487     0.996094        82329       256.00
   58753.023     0.996484        82355       284.44
   58818.559     0.996875        82395       320.00
   58916.863     0.997266        82438       365.71
   58982.399     0.997656        82456       426.67
   59080.703     0.998047        82494       512.00
   59113.471     0.998242        82516       568.89
   59113.471     0.998437        82516       640.00
   59179.007     0.998633        82535       731.43
   59211.775     0.998828        82556       853.33
   59277.311     0.999023        82574      1024.00
   59277.311     0.999121        82574      1137.78
   59310.079     0.999219        82600      1280.00
   59310.079     0.999316        82600      1462.86
   59310.079     0.999414        82600      1706.67
   59375.615     0.999512        82614      2048.00
   59375.615     0.999561        82614      2275.56
   59375.615     0.999609        82614      2560.00
   59408.383     0.999658        82639      2925.71
   59408.383     0.999707        82639      3413.33
   59408.383     0.999756        82639      4096.00
   59408.383     0.999780        82639      4551.11
   59408.383     0.999805        82639      5120.00
   59408.383     0.999829        82639      5851.43
   59408.383     0.999854        82639      6826.67
   59408.383     0.999878        82639      8192.00
   59408.383     0.999890        82639      9102.22
   59408.383     0.999902        82639     10240.00
   59408.383     0.999915        82639     11702.86
   59408.383     0.999927        82639     13653.33
   59408.383     0.999939        82639     16384.00
   59408.383     0.999945        82639     18204.44
   59408.383     0.999951        82639     20480.00
   59441.151     0.999957        82643     23405.71
   59441.151     1.000000        82643          inf
#[Mean    =    34347.476, StdDeviation   =    13595.465]
#[Max     =    59408.384, Total count    =        82643]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  98101 requests in 1.00m, 40.59MB read
  Socket errors: connect 0, read 0, write 0, timeout 43
Requests/sec:   1633.84
Transfer/sec:    692.27KB